app/controllers/images_controller.rb

INSERT INTO "images" ("title", "scenery_name", "scenery_address", "scenery_picture", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @image = Image.new(image_params)
    @image.user_id = current_user.id

    respond_to do |format|
      if @image.save