app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$/wx6wV8JHc7CDIFDMAK0ruYqzBvVD9Q7Iv9notuftSNzzom9lbBK."], ["updated_at", 2017-04-11 11:21:41 UTC], ["id", 1]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "Can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)